{"pageProps":{"projects":[{"name":"Kasa","cover":{"src":"/projet_8_openclassrooms//_next/static/media/banner-kasa.779442a8.png","height":288,"width":728,"blurDataURL":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAgAAAADCAIAAAAhqtkfAAAAVklEQVR42gFLALT/APu7vOvNy/3l59/AvN60ru/Nyd7Fvvq7ugDqraavsKf2+PjazsjayMPOy7vI0czfrK4A73Fl2WxX99DL//X1//f34ry265mW9pKTems48QUkiGEAAAAASUVORK5CYII=","blurWidth":8,"blurHeight":3},"tags":"React, ReactRouter, Tests","sources":"https://github.com/JeremyDarbellay/projet_6_openclassrooms","demo":"https://jeremydarbellay.github.io/projet_6_openclassrooms/","description":"Découvrez React à travers un projet passionnant de création d'un front-end pour Kasa. En utilisant React et React Router, sans autres dépendances, l'objectif était de construire une Single Page Application. Malgré les contraintes imposées par Kasa, telles que l'interdiction d'utiliser des modules externes, des composants personnalisés tels qu'un accordéon, un carrousel et une bannière ont été développés. Les défis ont inclus la mise en place du routing avec ReactRouter v6.9. Cette expérience a changé ma perspective sur React, désormais je comprends mieux l'utilité des composants réutilisables. De plus, jh'ai acquis une meilleure compréhension des tests et de leur utilité.","shortDescription":"Découvrez React à travers un projet passionnant de création d'un front-end pour Kasa. En utilisant React et React Router, sans autres dépendances, l'objectif était de construire une Single Page Application, malgré les contraintes imposées par Kasa.","title":"Projet Kasa de Jérémy Darbellay","url":"https:/jeremydarbellay.github.io/projet_8_openclassrooms/projets/Kasa"},{"name":"Portfolio","cover":{"src":"/projet_8_openclassrooms//_next/static/media/portfolio-beta.a589e7d8.png","height":774,"width":1876,"blurDataURL":"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAgAAAADCAIAAAAhqtkfAAAATUlEQVR42iWKMQ6AIAwA+f+qPskBNp0UgwRaS7DY8ASbkNx0d+ZjIIwphQduYWhvVqOYLsVZO82LsyvXhNlr60Kmlniduz82wqDjQBr+M5o+6Hel20IAAAAASUVORK5CYII=","blurWidth":8,"blurHeight":3},"tags":"Next, MDX, SEO","sources":"https://github.com/JeremyDarbellay/projet_8_openclassrooms","demo":"/","description":"Dans ce projet de création de mon portfolio, j'ai utilisé Next.js pour construire un site simple en noir et blanc avec des animations légères. J'ai mis l'accent sur l'accessibilité, l'optimisation pour les moteurs de recherche et l'utilisation de markdown pour la publication. Le choix des technologies et du design a été un défi, mais Next.js s'est avéré être une excellente solution pour le routing et la génération de site statique. Ce projet m'a offert une vue globale de la mise en production d'un site vitrine et a renforcé mes compétences en Next.js.","shortDescription":"Dans ce projet de création de mon portfolio, j'ai utilisé Next.js pour construire un site simple en noir et blanc avec des animations légères. J'ai mis l'accent sur l'accessibilité, l'optimisation pour les moteurs de recherche et l'utilisation de markdown pour la publication.","title":"Projet Portfolio de Jérémy Darbellay","url":"https:/jeremydarbellay.github.io/projet_8_openclassrooms/projets/Portfolio"},{"name":"NinaCarducci","cover":{"src":"/projet_8_openclassrooms//_next/static/media/banner-nina.c8bbb18f.jpg","height":667,"width":1449,"blurDataURL":"data:image/jpeg;base64,/9j/4AAQSkZJRgABAQAAAQABAAD/2wCEAAoKCgoKCgsMDAsPEA4QDxYUExMUFiIYGhgaGCIzICUgICUgMy03LCksNy1RQDg4QFFeT0pPXnFlZXGPiI+7u/sBCgoKCgoKCwwMCw8QDhAPFhQTExQWIhgaGBoYIjMgJSAgJSAzLTcsKSw3LVFAODhAUV5PSk9ecWVlcY+Ij7u7+//CABEIAAQACAMBIgACEQEDEQH/xAAnAAEBAAAAAAAAAAAAAAAAAAAAAQEBAAAAAAAAAAAAAAAAAAAABP/aAAwDAQACEAMQAAAAgG3/xAAbEAADAAIDAAAAAAAAAAAAAAABAgMAIgQUMf/aAAgBAQABPwDqyTiQOzUaAY0LbeZ//8QAFxEBAAMAAAAAAAAAAAAAAAAAAQACMf/aAAgBAgEBPwC4Dk//xAAXEQADAQAAAAAAAAAAAAAAAAAAASEC/9oACAEDAQE/AMt2n//Z","blurWidth":8,"blurHeight":4},"tags":"SEO, Accessibilité, Débogage","sources":"https://github.com/JeremyDarbellay/projet_5_openclassrooms","demo":"https://jeremydarbellay.github.io/projet_5_openclassrooms/","description":"Dans ce projet d'optimisation, j'ai travaillé sur le site d'une photographe professionnelle, Nina Carducci, en améliorant la vitesse de chargement, la conformité aux normes d'accessibilité et la correction de bugs mineurs. L'accent a été mis sur l'optimisation du chargement des images et scripts, ainsi que sur l'accessibilité du site. En suivant les recommandations de Google, j'ai utilisé le format webp, redimensionné et compressé les images. L'accessibilité a été améliorée grâce à l'ajout de balises sémantiques, de rôles aria et de descriptions. Ce projet a également sensibilisé à l'importance des utilisateurs de technologies d'assistance.","shortDescription":"Dans ce projet d'optimisation, j'ai travaillé sur le site d'une photographe professionnelle, Nina Carducci, en améliorant la vitesse de chargement, la conformité aux normes d'accessibilité et la correction de bugs mineurs.","title":"Projet NinaCarducci de Jérémy Darbellay","url":"https:/jeremydarbellay.github.io/projet_8_openclassrooms/projets/NinaCarducci"}]},"__N_SSG":true}